Repository: lxd930808/LinguaCast
Catalog: ios/PodcastEnglishStudio/PodcastEnglishStudio/Support/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, pt_br, zh_hans, zh_hant

# settings.assistant_base_url
source: Assistant Base URL
ar: عنوان المساعد الأساسي
de: Assistenten-Basis-URL
es: URL base del asistente
fr: URL de base de l’assistant
ja: アシスタントのベース URL
ko: 어시스턴트 기본 URL
pt_br: URL base do assistente
zh_hans: 助手服务地址
zh_hant: 助手服務網址

# settings.assistant_service
source: Research Assistant Service
ar: خدمة مساعد البحث
de: Recherche-Assistentendienst
es: Servicio de asistente de investigación
fr: Service d’assistant de recherche
ja: リサーチアシスタントサービス
ko: 리서치 어시스턴트 서비스
pt_br: Serviço do assistente de pesquisa
zh_hans: 研究助手服务
zh_hant: 研究助手服務

# settings.assistant_service_enabled
source: Enable Research Assistant
ar: تفعيل مساعد البحث
de: Recherche-Assistent aktivieren
es: Activar el asistente de investigación
fr: Activer l’assistant de recherche
ja: リサーチアシスタントを有効にする
ko: 리서치 어시스턴트 사용
pt_br: Ativar o assistente de pesquisa
zh_hans: 启用研究助手
zh_hant: 啟用研究助手

# settings.assistant_service_help
source: The assistant service is separate from cloud generation. It uses its own HTTPS address and token.
ar: خدمة المساعد منفصلة عن التوليد السحابي وتستخدم عنوان HTTPS ورمزًا خاصين بها.
de: Der Assistentendienst ist von der Cloud-Generierung getrennt und nutzt eine eigene HTTPS-Adresse und ein eigenes Token.
es: El servicio del asistente es independiente de la generación en la nube. Usa su propia dirección HTTPS y token.
fr: Le service d’assistant est distinct de la génération cloud. Il utilise sa propre adresse HTTPS et son jeton.
ja: アシスタントサービスはクラウド生成とは別です。独自の HTTPS アドレスとトークンを使います。
ko: 어시스턴트 서비스는 클라우드 생성과 별개이며 자체 HTTPS 주소와 토큰을 사용합니다.
pt_br: O serviço do assistente é separado da geração na nuvem. Ele usa o próprio endereço HTTPS e token.
zh_hans: 助手服务与云端生成服务相互独立，使用单独的 HTTPS 地址和令牌。
zh_hant: 助手服務與雲端生成服務相互獨立，使用單獨的 HTTPS 網址和權杖。

# settings.assistant_service_status
source: Status
ar: الحالة
es: Estado
fr: État
ja: 状態
ko: 상태
zh_hans: 状态
zh_hant: 狀態

# settings.assistant_status_disabled
source: Disabled
ar: معطّل
de: Deaktiviert
es: Desactivado
fr: Désactivé
ja: オフ
ko: 꺼짐
pt_br: Desativado
zh_hans: 已关闭
zh_hant: 已關閉

# settings.assistant_status_missing_token
source: Access token not configured
ar: لم يُضبط رمز الوصول
de: Zugriffstoken nicht konfiguriert
es: Token de acceso no configurado
fr: Jeton d’accès non configuré
ja: アクセストークンが未設定です
ko: 액세스 토큰이 설정되지 않았습니다
pt_br: Token de acesso não configurado
zh_hans: 未配置访问令牌
zh_hant: 尚未設定存取權杖

# settings.assistant_status_ready
source: Ready
ar: جاهز
de: Bereit
es: Listo
fr: Prêt
ja: 準備完了
ko: 준비됨
pt_br: Pronto
zh_hans: 就绪
zh_hant: 就緒

# settings.assistant_token_not_set
source: Not set
ar: غير مضبوط
de: Nicht festgelegt
es: No definido
fr: Non défini
ja: 未設定
ko: 설정되지 않음
pt_br: Não definido
zh_hans: 未设置
zh_hant: 未設定

# settings.assistant_v2_enabled
source: Use V15 workspace research
ar: استخدام بحث مساحة العمل V15
de: V15-Workspace-Recherche verwenden
es: Usar investigación de espacio de trabajo V15
fr: Utiliser la recherche d’espace de travail V15
ja: V15ワークスペース研究を使う
ko: V15 워크스페이스 리서치 사용
pt_br: Usar pesquisa de espaço de trabalho V15
zh_hans: 使用 V15 工作区研究
zh_hant: 使用 V15 工作區研究

# settings.assistant_v2_help
source: When on, new research uses the V15 workspace API. Leave this off to keep the previous assistant experience.
ar: عند التشغيل تستخدم الأبحاث الجديدة واجهة مساحة العمل V15. اتركه مغلقًا للإبقاء على تجربة المساعد السابقة.
de: Wenn aktiv, nutzen neue Recherchen die V15-Workspace-API. Ausgeschaltet bleibt die bisherige Assistentenerfahrung.
es: Si está activado, las investigaciones nuevas usan la API de espacio de trabajo V15. Déjelo desactivado para conservar el asistente anterior.
fr: Une fois activé, les nouvelles recherches utilisent l’API d’espace de travail V15. Laissez désactivé pour conserver l’assistant précédent.
ja: オンにすると新規調査はV15ワークスペースAPIを使います。オフのままなら従来のアシスタントのままです。
ko: 켜면 새 리서치가 V15 워크스페이스 API를 사용합니다. 끄면 기존 어시스턴트를 유지합니다.
pt_br: Quando ativado, novas pesquisas usam a API de espaço de trabalho V15. Deixe desligado para manter o assistente anterior.
zh_hans: 开启后，新建研究走 V15 工作区接口。关闭则继续使用原来的助手体验。
zh_hant: 開啟後，新建研究走 V15 工作區介面。關閉則繼續使用原來的助手體驗。

# settings.base_url
source: Base URL
ar: عنوان URL الأساسي
de: Basis-URL
es: URL base
fr: URL de base
ja: ベース URL
ko: 기본 URL
pt_br: URL base
zh_hans: 基础 URL
zh_hant: 基礎 URL

# settings.clear_cache.help
source: Remove bilingual subtitle files from iCloud. This cannot be undone.
ar: يزيل ملفات الترجمة ثنائية اللغة من iCloud. لا يمكن التراجع.
de: Entfernt zweisprachige Untertiteldateien aus iCloud. Das kann nicht rückgängig gemacht werden.
es: Elimina los archivos de subtítulos bilingües de iCloud. No se puede deshacer.
fr: Supprime les fichiers de sous-titres bilingues d’iCloud. Cette action est irréversible.
ja: iCloudからバイリンガル字幕ファイルを削除します。元に戻せません。
ko: iCloud에서 이중 언어 자막 파일을 삭제합니다. 되돌릴 수 없습니다.
pt_br: Remove os arquivos de legendas bilíngues do iCloud. Não pode ser desfeito.
zh_hans: 从 iCloud 删除双语字幕文件。此操作无法撤销。
zh_hant: 從 iCloud 刪除雙語字幕檔案。此操作無法復原。

# settings.clear_icloud_subtitle_cache
source: Clear iCloud Subtitle Cache
ar: مسح ذاكرة ترجمات iCloud
de: iCloud-Untertitelcache löschen
es: Borrar la caché de subtítulos de iCloud
fr: Effacer le cache des sous-titres iCloud
ja: iCloud字幕キャッシュを消去
ko: iCloud 자막 캐시 지우기
pt_br: Limpar cache de legendas do iCloud
zh_hans: 清除 iCloud 字幕缓存
zh_hant: 清除 iCloud 字幕快取

# settings.cloud_access_token
source: Access Token
ar: رمز الوصول
de: Zugriffstoken
es: Token de acceso
fr: Jeton d’accès
ja: アクセストークン
ko: 액세스 토큰
pt_br: Token de acesso
zh_hans: 访问令牌
zh_hant: 存取權杖

# settings.cloud_active_jobs
source: Active Cloud Jobs
ar: المهام السحابية النشطة
de: Aktive Cloud-Aufträge
es: Trabajos activos en la nube
fr: Tâches cloud actives
ja: アクティブなクラウドジョブ
ko: 활성 클라우드 작업
pt_br: Trabalhos ativos na nuvem
zh_hans: 进行中的云端任务
zh_hant: 進行中的雲端任務

# settings.cloud_base_url
source: Service Base URL
ar: عنوان URL الأساسي للخدمة
de: Basis-URL des Dienstes
es: URL base del servicio
fr: URL de base du service
ja: サービスのベースURL
ko: 서비스 기본 URL
pt_br: URL base do serviço
zh_hans: 服务基础 URL
zh_hant: 服務基礎 URL

# settings.cloud_service
source: Cloud Generation Service
ar: خدمة الإنشاء السحابي
de: Cloud-Generierungsdienst
es: Servicio de generación en la nube
fr: Service de génération cloud
ja: クラウド生成サービス
ko: 클라우드 생성 서비스
pt_br: Serviço de geração na nuvem
zh_hans: 云端生成服务
zh_hant: 雲端生成服務

# settings.cloud_service_advanced
source: Cloud Service (Advanced)
ar: الخدمة السحابية (متقدم)
de: Cloud-Dienst (erweitert)
es: Servicio en la nube (avanzado)
fr: Service cloud (avancé)
ja: クラウドサービス（詳細）
ko: 클라우드 서비스 (고급)
pt_br: Serviço na nuvem (avançado)
zh_hans: 云端服务（高级）
zh_hant: 雲端服務（進階）

# settings.cloud_service_enabled
source: Enable Cloud Generation Service
ar: تفعيل خدمة الإنشاء السحابي
de: Cloud-Generierungsdienst aktivieren
es: Activar el servicio de generación en la nube
fr: Activer le service de génération cloud
ja: クラウド生成サービスを有効化
ko: 클라우드 생성 서비스 활성화
pt_br: Ativar o serviço de geração na nuvem
zh_hans: 启用云端生成服务
zh_hant: 啟用雲端生成服務

# settings.cloud_service_help
source: Cloud generation runs on your own server, so this device does not need DashScope or translation keys.
ar: يتم الإنشاء السحابي على خادمك الخاص، لذا لا يحتاج هذا الجهاز إلى مفاتيح DashScope أو الترجمة.
de: Die Cloud-Generierung läuft auf deinem eigenen Server, daher benötigt dieses Gerät keine DashScope- oder Übersetzungsschlüssel.
es: La generación en la nube se ejecuta en tu propio servidor, por lo que este dispositivo no necesita claves de DashScope ni de traducción.
fr: La génération cloud s’exécute sur votre propre serveur ; cet appareil n’a donc pas besoin de clés DashScope ni de traduction.
ja: クラウド生成は自分のサーバーで実行されるため、このデバイスには DashScope や翻訳キーは不要です。
ko: 클라우드 생성은 사용자의 서버에서 실행되므로 이 기기에는 DashScope 또는 번역 키가 필요하지 않습니다.
pt_br: A geração na nuvem roda no seu próprio servidor, portanto este dispositivo não precisa de chaves do DashScope ou de tradução.
zh_hans: 云端生成在你自己的服务器上运行，因此本设备无需 DashScope 或翻译密钥。
zh_hant: 雲端生成在你自己的伺服器上運行，因此本裝置無需 DashScope 或翻譯金鑰。

# settings.cloud_service_status
source: Status
ar: الحالة
es: Estado
fr: Statut
ja: ステータス
ko: 상태
zh_hans: 状态
zh_hant: 狀態

# settings.cloud_status.help
source: The service is ready when it is enabled and an access token is configured.
ar: تكون الخدمة جاهزة عند تفعيلها وإعداد رمز وصول.
de: Der Dienst ist bereit, wenn er aktiviert ist und ein Zugriffstoken vorliegt.
es: El servicio está listo cuando está activado y hay un token de acceso.
fr: Le service est prêt lorsqu’il est activé et qu’un jeton d’accès est configuré.
ja: 有効でアクセストークンが設定されているとサービスは準備完了です。
ko: 서비스가 켜져 있고 액세스 토큰이 있으면 준비된 상태입니다.
pt_br: O serviço fica pronto quando está ativado e um token de acesso está configurado.
zh_hans: 服务已启用且配置了访问令牌时即为就绪。
zh_hant: 服務已啟用且設定了存取權杖時即為就緒。

# settings.cloud_status_disabled
source: Disabled
ar: معطّل
de: Deaktiviert
es: Desactivado
fr: Désactivé
ja: 無効
ko: 비활성화됨
pt_br: Desativado
zh_hans: 已停用
zh_hant: 已停用

# settings.cloud_status_missing_token
source: Access token not configured
ar: رمز الوصول غير مهيأ
de: Zugriffstoken nicht konfiguriert
es: Token de acceso no configurado
fr: Jeton d’accès non configuré
ja: アクセストークンが未設定です
ko: 액세스 토큰이 설정되지 않음
pt_br: Token de acesso não configurado
zh_hans: 未配置访问令牌
zh_hant: 未設定存取權杖

# settings.cloud_status_ready
source: Ready
ar: جاهز
de: Bereit
es: Listo
fr: Prêt
ja: 準備完了
ko: 준비됨
pt_br: Pronto
zh_hans: 就绪
zh_hant: 就緒

# settings.cloud_token.help
source: The token is stored in the Keychain and never shown in full.
ar: يُحفظ الرمز في سلسلة المفاتيح ولا يُعرض كاملاً أبدًا.
de: Das Token liegt in der Keychain und wird nie vollständig angezeigt.
es: El token se guarda en el llavero y nunca se muestra completo.
fr: Le jeton est stocké dans le trousseau et n’est jamais affiché en entier.
ja: トークンはキーチェーンに保存され、全文は表示されません。
ko: 토큰은 키체인에 저장되며 전체는 표시되지 않습니다.
pt_br: O token fica no Keychain e nunca é exibido por completo.
zh_hans: 令牌保存在钥匙串中，不会完整显示。
zh_hant: 權杖保存在鑰匙圈中，不會完整顯示。

# settings.cloud_token_not_set
source: Not set
ar: غير مضبوط
de: Nicht gesetzt
es: No configurado
fr: Non défini
ja: 未設定
ko: 설정되지 않음
pt_br: Não definido
zh_hans: 未设置
zh_hant: 未設定

# settings.cloud_token_privacy_note
source: The token is stored in the Keychain and never shown in full.
ar: يُخزَّن الرمز في سلسلة المفاتيح ولا يُعرض كاملًا أبدًا.
de: Das Token wird im Schlüsselbund gespeichert und nie vollständig angezeigt.
es: El token se guarda en el llavero y nunca se muestra completo.
fr: Le jeton est stocké dans le trousseau et n’est jamais affiché en entier.
ja: トークンはキーチェーンに保存され、完全には表示されません。
ko: 토큰은 키체인에 저장되며 전체가 표시되지 않습니다.
pt_br: O token é armazenado no chaveiro e nunca é exibido por completo.
zh_hans: 令牌存储在钥匙串中，绝不会完整显示。
zh_hant: 權杖儲存在鑰匙圈中，絕不會完整顯示。

# settings.cloud_url.help
source: Set the service URL on iPhone or with Set Up by Phone.
ar: عيّن عنوان الخدمة على iPhone أو عبر الإعداد بالهاتف.
de: Legen Sie die Dienst-URL auf dem iPhone oder unter „Per iPhone einrichten“ fest.
es: Configura la URL del servicio en el iPhone o con Configurar con el teléfono.
fr: Définissez l’URL du service sur iPhone ou via Configuration par téléphone.
ja: サービスURLはiPhoneか「携帯電話で設定」で指定してください。
ko: 서비스 URL은 iPhone 또는 휴대폰으로 설정에서 지정하세요.
pt_br: Defina o URL do serviço no iPhone ou em Configurar pelo telefone.
zh_hans: 请在 iPhone 上或通过「用手机配置」设置服务地址。
zh_hant: 請在 iPhone 上或透過「用手機設定」設定服務網址。

# settings.configuration_progress
source: Setup Progress
ar: تقدم الإعداد
de: Einrichtungsfortschritt
es: Progreso de configuración
fr: Progression de la configuration
ja: 設定の進行状況
ko: 설정 진행률
pt_br: Progresso da configuração
zh_hans: 配置进度
zh_hant: 設定進度

# settings.configuration_progress.help
source: See which API keys are still missing.
ar: اطلع على مفاتيح API التي ما زالت ناقصة.
de: Sehen Sie, welche API-Schlüssel noch fehlen.
es: Consulta qué claves de API faltan.
fr: Voir quelles clés API manquent encore.
ja: まだ不足しているAPIキーを確認します。
ko: 아직 없는 API 키를 확인합니다.
pt_br: Veja quais chaves de API ainda faltam.
zh_hans: 查看仍缺少哪些 API 密钥。
zh_hant: 查看仍缺少哪些 API 金鑰。

# settings.configured
source: Configured
ar: مُعدّ
de: Konfiguriert
es: Configurado
fr: Configuré
ja: 設定済み
ko: 구성됨
pt_br: Configurado
zh_hans: 已配置
zh_hant: 已設定

# settings.confirm_merge.help
source: Merge local data into the new iCloud account.
ar: دمج البيانات المحلية في حساب iCloud الجديد.
de: Lokale Daten mit dem neuen iCloud-Account zusammenführen.
es: Fusiona los datos locales en la nueva cuenta de iCloud.
fr: Fusionner les données locales dans le nouveau compte iCloud.
ja: ローカルデータを新しいiCloudアカウントに結合します。
ko: 로컬 데이터를 새 iCloud 계정으로 병합합니다.
pt_br: Mesclar os dados locais na nova conta do iCloud.
zh_hans: 将本地数据合并到新的 iCloud 账户。
zh_hant: 將本機資料合併到新的 iCloud 帳户。

# settings.confirm_merge_into_new_icloud
source: Confirm merge into new iCloud
ar: تأكيد الدمج في iCloud الجديد
de: Bestätigen Sie die Zusammenführung mit dem neuen iCloud.
es: Confirmar fusión en nuevo iCloud
fr: Confirmez la fusion avec le nouveau iCloud
ja: 新しい iCloud へのマージを確認します
ko: 새로운 iCloud로 병합 확인
pt_br: Confirme a fusão com o novo iCloud
zh_hans: 确认合并到新 iCloud
zh_hant: 確認合併到新 iCloud

# settings.content_filter
source: Content Filter
ar: عامل تصفية المحتوى
de: Inhaltsfilter
es: Filtro de contenido
fr: Filtre de contenu
ja: コンテンツフィルター
ko: 콘텐츠 필터
pt_br: Filtro de conteúdo
zh_hans: 内容过滤
zh_hant: 內容過濾

# settings.content_filter_enabled
source: Enable Content Filter
ar: تفعيل عامل تصفية المحتوى
de: Inhaltsfilter aktivieren
es: Activar filtro de contenido
fr: Activer le filtre de contenu
ja: コンテンツフィルターを有効化
ko: 콘텐츠 필터 활성화
pt_br: Ativar filtro de conteúdo
zh_hans: 启用内容过滤
zh_hant: 啟用內容過濾

# settings.content_filter_help
source: Matching episodes and videos are hidden from lists. Keywords apply instantly; the agent instruction uses the configured Translation LLM when available.
ar: يتم إخفاء الحلقات والفيديوهات المطابقة من القوائم. تعمل الكلمات المفتاحية فورًا؛ أما تعليمات الوكيل فتستخدم نموذج الترجمة المُهيأ عند توفره.
de: Passende Episoden und Videos werden in Listen ausgeblendet. Stichwörter wirken sofort; die Agent-Anweisung nutzt bei Verfügbarkeit das konfigurierte Übersetzungs-LLM.
es: Los episodios y videos coincidentes se ocultan de las listas. Las palabras clave se aplican al instante; la instrucción del agente usa el LLM de traducción configurado cuando está disponible.
fr: Les épisodes et vidéos correspondants sont masqués des listes. Les mots-clés s'appliquent instantanément ; l'instruction de l'agent utilise le LLM de traduction configuré lorsqu'il est disponible.
ja: 一致するエピソードや動画はリストに表示されなくなります。キーワードは即時に適用され、エージェント指示は設定済みの翻訳LLMが利用可能な場合に使用されます。
ko: 일치하는 에피소드와 동영상이 목록에서 숨겨집니다. 키워드는 즉시 적용되며, 에이전트 지시는 구성된 번역 LLM이 있을 때 사용됩니다.
pt_br: Episódios e vídeos correspondentes ficam ocultos nas listas. As palavras-chave se aplicam instantaneamente; a instrução do agente usa o LLM de tradução configurado quando disponível.
zh_hans: 匹配的剧集和视频将在列表中隐藏。关键词即时生效；代理指令会在已配置翻译 LLM 时使用。
zh_hant: 匹配的劇集和影片將在列表中隱藏。關鍵詞即時生效；代理指令會在已配置翻譯 LLM 時使用。

# settings.content_filter_keywords
source: Keywords, comma or space separated
ar: كلمات مفتاحية، مفصولة بفواصل أو مسافات
de: Stichwörter, durch Kommas oder Leerzeichen getrennt
es: Palabras clave, separadas por comas o espacios
fr: Mots-clés, séparés par des virgules ou des espaces
ja: キーワード（カンマまたはスペース区切り）
ko: 키워드, 쉼표 또는 공백으로 구분
pt_br: Palavras-chave, separadas por vírgulas ou espaços
zh_hans: 关键词（逗号或空格分隔）
zh_hant: 關鍵詞（逗號或空格分隔）

# settings.content_filter_keywords_label
source: Keywords
ar: كلمات مفتاحية
de: Stichwörter
es: Palabras clave
fr: Mots-clés
ja: キーワード
ko: 키워드
pt_br: Palavras-chave
zh_hans: 关键词
zh_hant: 關鍵字

# settings.content_filter_prompt
source: Agent instruction (optional)
ar: تعليمات الوكيل (اختياري)
de: Agent-Anweisung (optional)
es: Instrucción del agente (opcional)
fr: Instruction de l'agent (facultatif)
ja: エージェント指示（任意）
ko: 에이전트 지시(선택 사항)
pt_br: Instrução do agente (opcional)
zh_hans: 代理指令（可选）
zh_hant: 代理指令（可選）

# settings.dashscope_api_key
source: DashScope API Key
ar: مفتاح DashScope API
de: DashScope API-Schlüssel
es: Clave de DashScope API
fr: Clé API DashScope
ja: DashScope API キー
ko: DashScope API 키
pt_br: Chave da API DashScope
zh_hans: DashScope API 密钥
zh_hant: DashScope API 金鑰

# settings.endpoint
source: Endpoint
ar: نقطة النهاية
de: Endpunkt
es: Punto de conexión
fr: Point de terminaison
ja: エンドポイント
ko: 엔드포인트

# settings.extra_large
source: Extra large
ar: كبير جدًا
de: extra groß
es: extra grande
fr: très grand
ja: 特大
ko: 초대형
pt_br: extra grande
zh_hans: 特大
zh_hant: 特大

# settings.filter_keywords.help
source: Edit keywords on iPhone or with Set Up by Phone.
ar: عدّل الكلمات المفتاحية على iPhone أو عبر الإعداد بالهاتف.
de: Bearbeiten Sie Stichwörter auf dem iPhone oder unter „Per iPhone einrichten“.
es: Edita las palabras clave en el iPhone o con Configurar con el teléfono.
fr: Modifiez les mots-clés sur iPhone ou via Configuration par téléphone.
ja: キーワードはiPhoneか「携帯電話で設定」で編集してください。
ko: 키워드는 iPhone 또는 휴대폰으로 설정에서 편집하세요.
pt_br: Edite as palavras-chave no iPhone ou em Configurar pelo telefone.
zh_hans: 请在 iPhone 上或通过「用手机配置」编辑关键词。
zh_hant: 請在 iPhone 上或透過「用手機設定」編輯關鍵字。

# settings.generation_backend
source: Generation Backend
ar: الواجهة الخلفية للإنشاء
de: Generierungs-Backend
es: Backend de generación
fr: Backend de génération
ja: 生成バックエンド
ko: 생성 백엔드
pt_br: Backend de geração
zh_hans: 生成后端
zh_hant: 生成後端

# settings.generation_backend.help
source: Cloud Service runs generation on your server. On-Device uses keys stored on this device.
ar: تعمل الخدمة السحابية على خادمك. الوضع على الجهاز يستخدم المفاتيح المحلية.
de: Der Clouddienst erzeugt auf Ihrem Server. Auf dem Gerät werden lokale Schlüssel verwendet.
es: El servicio en la nube genera en tu servidor. En el dispositivo usa las claves locales.
fr: Le service cloud génère sur votre serveur. Sur l’appareil, les clés locales sont utilisées.
ja: クラウドサービスはサーバーで生成します。オンデバイスはこの端末のキーを使います。
ko: 클라우드 서비스는 서버에서 생성합니다. 기기 내 방식은 이 기기의 키를 사용합니다.
pt_br: O serviço na nuvem gera no seu servidor. No dispositivo usa as chaves locais.
zh_hans: 「云端服务」在你的服务器上生成。「本机」使用此设备上的密钥。
zh_hant: 「雲端服務」在你的伺服器上產生。「本機」使用此裝置上的金鑰。

# settings.generation_backend_cloud
source: Cloud Service
ar: الخدمة السحابية
de: Cloud-Dienst
es: Servicio en la nube
fr: Service cloud
ja: クラウドサービス
ko: 클라우드 서비스
pt_br: Serviço na nuvem
zh_hans: 云端服务
zh_hant: 雲端服務

# settings.generation_backend_cloud.help
source: Run transcription and translation on your server.
ar: تشغيل التفريغ والترجمة على خادمك.
de: Transkription und Übersetzung auf Ihrem Server ausführen.
es: Ejecuta la transcripción y la traducción en tu servidor.
fr: Exécuter la transcription et la traduction sur votre serveur.
ja: 文字起こしと翻訳をサーバーで実行します。
ko: 전사와 번역을 서버에서 실행합니다.
pt_br: Executar transcrição e tradução no seu servidor.
zh_hans: 在你的服务器上运行转写和翻译。
zh_hant: 在你的伺服器上執行轉寫與翻譯。

# settings.generation_backend_local
source: On-Device (Legacy)
ar: على الجهاز (قديم)
de: Auf dem Gerät (Legacy)
es: En el dispositivo (heredado)
fr: Sur l’appareil (ancien)
ja: オンデバイス（従来）
ko: 기기 내 (레거시)
pt_br: No dispositivo (legado)
zh_hans: 设备端（旧版）
zh_hant: 裝置端（舊版）

# settings.generation_backend_local.help
source: Use DashScope and translation keys stored on this device.
ar: استخدام مفاتيح DashScope والترجمة المخزّنة على هذا الجهاز.
de: DashScope- und Übersetzungsschlüssel auf diesem Gerät verwenden.
es: Usa las claves de DashScope y de traducción guardadas en este dispositivo.
fr: Utiliser les clés DashScope et de traduction stockées sur cet appareil.
ja: このデバイスに保存したDashScopeと翻訳キーを使います。
ko: 이 기기에 저장된 DashScope 및 번역 키를 사용합니다.
pt_br: Usar as chaves DashScope e de tradução armazenadas neste dispositivo.
zh_hans: 使用此设备上保存的 DashScope 与翻译密钥。
zh_hant: 使用此裝置上儲存的 DashScope 與翻譯金鑰。

# settings.group.content_generation
source: Content Generation
ar: توليد المحتوى
de: Inhaltserzeugung
es: Generación de contenido
fr: Génération de contenu
ja: コンテンツ生成
ko: 콘텐츠 생성
pt_br: Geração de conteúdo
zh_hans: 内容生成
zh_hant: 內容產生

# settings.group.icloud_and_setup
source: iCloud and Setup
ar: iCloud والإعداد
de: iCloud und Einrichtung
es: iCloud y configuración
fr: iCloud et configuration
ja: iCloudと設定
ko: iCloud 및 설정
pt_br: iCloud e configuração
zh_hans: iCloud 与配置
zh_hant: iCloud 與設定

# settings.group.other
source: Other
ar: أخرى
de: Weitere
es: Otros
fr: Autres
ja: その他
ko: 기타
pt_br: Outros
zh_hans: 其他
zh_hant: 其他

# settings.group.playback_and_subtitles
source: Playback and Subtitles
ar: التشغيل والترجمة
de: Wiedergabe und Untertitel
es: Reproducción y subtítulos
fr: Lecture et sous-titres
ja: 再生と字幕
ko: 재생 및 자막
pt_br: Reprodução e legendas
zh_hans: 播放与字幕
zh_hant: 播放與字幕

# settings.icloud_cache.help
source: Completed bilingual subtitles stored in iCloud.
ar: ترجمات ثنائية اللغة مكتملة مخزّنة في iCloud.
de: Fertige zweisprachige Untertitel in iCloud.
es: Subtítulos bilingües completados almacenados en iCloud.
fr: Sous-titres bilingues terminés stockés dans iCloud.
ja: 完了したバイリンガル字幕がiCloudに保存されています。
ko: 완료된 이중 언어 자막이 iCloud에 저장됩니다.
pt_br: Legendas bilíngues concluídas armazenadas no iCloud.
zh_hans: 已完成的双语字幕存储在 iCloud 中。
zh_hant: 已完成的雙語字幕儲存在 iCloud 中。

# settings.icloud_status
source: Status
ar: الحالة
es: Estado
fr: État
ja: ステータス
ko: 상태
zh_hans: 状态
zh_hant: 狀態

# settings.icloud_subtitle_cache
source: Cloud Subtitle Cache
ar: ذاكرة ترجمات iCloud
de: iCloud-Untertitelcache
es: Caché de subtítulos de iCloud
fr: Cache des sous-titres iCloud
ja: iCloud字幕キャッシュ
ko: iCloud 자막 캐시
pt_br: Cache de legendas do iCloud
zh_hans: iCloud 字幕缓存
zh_hant: iCloud 字幕快取

# settings.icloud_sync
source: iCloud Sync
ar: مزامنة iCloud
de: iCloud-Synchronisierung
es: Sincronización con iCloud
fr: Synchronisation iCloud
ja: iCloud同期
ko: iCloud 동기화
pt_br: Sincronização do iCloud
zh_hans: iCloud 同步
zh_hant: iCloud 同步

# settings.icloud_sync.help
source: View sync status, subtitle cache, and sync now.
ar: عرض حالة المزامنة وذاكرة الترجمة والمزامنة الآن.
de: Sync-Status, Untertitel-Cache und Jetzt synchronisieren anzeigen.
es: Consulta el estado de sincronización, la caché de subtítulos y sincroniza ahora.
fr: Voir l’état de synchronisation, le cache des sous-titres et synchroniser maintenant.
ja: 同期状態、字幕キャッシュ、今すぐ同期を確認します。
ko: 동기화 상태, 자막 캐시, 지금 동기화를 확인합니다.
pt_br: Veja o status da sincronização, o cache de legendas e sincronize agora.
zh_hans: 查看同步状态、字幕缓存，并可立即同步。
zh_hant: 查看同步狀態、字幕快取，並可立即同步。

# settings.ios_youtube_playback_mode
source: iOS YouTube Playback
ar: تشغيل YouTube على iOS
de: iOS-YouTube-Wiedergabe
es: Reproducción de YouTube en iOS
fr: Lecture YouTube sur iOS
ja: iOS YouTube 再生形式
ko: iOS YouTube 재생 형식
pt_br: Reprodução do YouTube no iOS
zh_hans: iOS YouTube 视频播放形式
zh_hant: iOS YouTube 影片播放形式

# settings.large
source: Large
ar: كبير
de: Groß
es: grande
fr: Grand
ja: 大きい
ko: 큰
pt_br: Grande
zh_hans: 大
zh_hant: 大

# settings.legacy_local_pipeline
source: Legacy On-Device Pipeline
ar: خط المعالجة القديم على الجهاز
de: Legacy-Pipeline auf dem Gerät
es: Pipeline heredado en el dispositivo
fr: Pipeline local (ancien)
ja: 従来のオンデバイスパイプライン
ko: 레거시 기기 내 파이프라인
pt_br: Pipeline legado no dispositivo
zh_hans: 旧版设备端流水线
zh_hant: 舊版裝置端管線
